Install Library
!pip3 install ipython-sql

In [1]:
import pandas as pd
import sqlite3
import sql

In [2]:
cnn = sqlite3.connect('connect_sql_jupyter.db')

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///connect_sql_jupyter.db

# Data Preparation

In [5]:
contract = pd.read_csv('contract_db.csv')
customer = pd.read_csv('customer_db.csv')
job = pd.read_csv('job_db.csv')
location = pd.read_csv('location_db.csv')
payment = pd.read_csv('payment_db.csv')

In [6]:
print(contract.isna().sum())

contract_id    0
duration       0
dtype: int64

In [7]:
print(customer.isna().sum())

customer_id            0
lat                    0
lng                    0
population             0
children               0
age                    0
income                 0
marital                0
churn                  0
gender                 0
tenure                 0
monthly_charge         0
bandwidth_gp_year      0
outage_sec_week        0
email                  0
contacts               0
yearly_equip_faiure    0
techie                 0
port_modem             0
tablet                 0
job_id                 0
payment_id             0
contract_id            0
location_id            0
dtype: int64

In [8]:
print(location.isna().sum())

location_id    0
zip            0
city           0
state          0
county         0
dtype: int64

In [9]:
print(job.isna().sum())

job_id       0
job_title    0
dtype: int64

In [10]:
print(payment.isna().sum())

payment_id      0
payment_type    0
dtype: int64

# Database Creation and Data Alignment

In [11]:
#Import Tables into SQL Lite for Database Creation. 
#These tables were exported from PGAdmin which had the Data Alignment fixed beforehand

contract.to_sql('contract', cnn, index=False)
customer.to_sql('customer', cnn, index=False)
location.to_sql('location', cnn, index=False)
job.to_sql('job', cnn, index=False)
payment.to_sql('payment', cnn, index=False)

# SQL

In [12]:
%%sql
SELECT *
FROM contract
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(1, 'Month-to-month'), (2, 'One year'), (3, 'Two Year')]

# SQL Scripts to Enforce Referential Integrity

In [13]:
%%sql

ALTER TABLE contract RENAME TO old_contract;

CREATE TABLE contract
(
  contract_id datatype [ NULL | NOT NULL ],
  duration datatype [ NULL | NOT NULL ],
  CONSTRAINT contract_pkey PRIMARY KEY (contract_id)
);

INSERT INTO contract SELECT * FROM old_contract;

DROP TABLE old_contract;

 * sqlite:///connect_sql_jupyter.db
Done.
Done.
3 rows affected.
Done.

[]

In [14]:
#Commit change into the database
cnn.commit()

In [15]:
%%sql

SELECT *
FROM contract
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(1, 'Month-to-month'), (2, 'One year'), (3, 'Two Year')]

In [16]:

%%sql

ALTER TABLE customer RENAME TO old_customer;

CREATE TABLE customer
(
  customer_id [ NULL | NOT NULL ] COLLATE NOCASE NOT NULL,
    lat datatype [ NULL | NOT NULL ],
    lng datatype [ NULL | NOT NULL ],
    population datatype [ NULL | NOT NULL ],
    children datatype [ NULL | NOT NULL ],
    age datatype [ NULL | NOT NULL ],
    income datatype [ NULL | NOT NULL ],
    marital datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    churn datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    gender datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    tenure datatype [ NULL | NOT NULL ],
    monthly_charge datatype [ NULL | NOT NULL ],
    bandwidth_gp_year datatype [ NULL | NOT NULL ],
    outage_sec_week datatype [ NULL | NOT NULL ],
    email datatype [ NULL | NOT NULL ],
    contacts datatype [ NULL | NOT NULL ],
    yearly_equip_faiure datatype [ NULL | NOT NULL ],
    techie datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    port_modem datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    tablet datatype [ NULL | NOT NULL ] COLLATE NOCASE,
    job_id datatype [ NULL | NOT NULL ],
    payment_id datatype [ NULL | NOT NULL ],
    contract_id datatype [ NULL | NOT NULL ],
    location_id datatype [ NULL | NOT NULL ],
    CONSTRAINT customer_pkey PRIMARY KEY (customer_id),
    CONSTRAINT customer_contract_id_fkey FOREIGN KEY (contract_id)
        REFERENCES contract (contract_id) MATCH SIMPLE
        ON UPDATE NO ACTION
        ON DELETE NO ACTION,
    CONSTRAINT customer_job_id_fkey FOREIGN KEY (job_id)
        REFERENCES job (job_id) MATCH SIMPLE
        ON UPDATE NO ACTION
        ON DELETE NO ACTION,
    CONSTRAINT customer_location_id_fkey FOREIGN KEY (location_id)
        REFERENCES location (location_id) MATCH SIMPLE
        ON UPDATE NO ACTION
        ON DELETE NO ACTION,
    CONSTRAINT customer_payment_id_fkey FOREIGN KEY (payment_id)
        REFERENCES payment (payment_id) MATCH SIMPLE
        ON UPDATE NO ACTION
        ON DELETE NO ACTION
);

INSERT INTO customer SELECT * FROM old_customer;

DROP TABLE old_customer;

 * sqlite:///connect_sql_jupyter.db
Done.
Done.
10000 rows affected.
Done.

[]

In [17]:
cnn.commit()

In [18]:
%%sql
SELECT*
FROM customer
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[('K409198', 56.251, -133.37571, 38, 0, 68, 28561.99, 'Widowed', 'No', 'Male', 6.795512947, 172.455519, 904.5361102, 7.978322947, 10, 0, 1, 'No', 'Yes', 'Yes', 229, 2, 2, 5599),
 ('S120509', 44.32893, -84.2408, 10446, 1, 27, 21704.77, 'Married', 'Yes', 'Female', 1.156680997, 242.632554, 800.9827661, 11.69907956, 12, 0, 1, 'Yes', 'No', 'Yes', 468, 1, 1, 2737),
 ('K191035', 45.35589, -123.24657, 3735, 4, 50, 9609.57, 'Widowed', 'No', 'Female', 15.75414408, 159.947583, 2054.706961, 10.75280028, 9, 0, 1, 'Yes', 'Yes', 'No', 96, 2, 3, 1297),
 ('D90850', 32.96687, -117.24798, 13863, 1, 48, 18925.23, 'Married', 'No', 'Male', 17.08722662, 119.95684, 2164.579412, 14.91353964, 15, 2, 0, 'Yes', 'No', 'No', 552, 4, 3, 5181),
 ('K662701', 29.38012, -95.80673, 11352, 0, 83, 40074.19, 'Separated', 'Yes', 'Male', 1.670971726, 149.948316, 271.4934362, 8.147416533, 16, 2, 1, 'No', 'Yes', 'No', 371, 4, 1, 30)]

In [19]:

%%sql


ALTER TABLE job RENAME TO old_job;

CREATE TABLE job
(
  job_id datatype [ NULL | NOT NULL ],
  job_title datatype [ NULL | NOT NULL ],
  CONSTRAINT job_pkey PRIMARY KEY (job_id)
);

INSERT INTO job SELECT * FROM old_job;

DROP TABLE old_job;

 * sqlite:///connect_sql_jupyter.db
Done.
Done.
639 rows affected.
Done.

[]

In [20]:
cnn.commit()

In [21]:
%%sql

SELECT *
FROM job
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(1, 'Academic librarian'),
 (2, 'Accommodation manager'),
 (3, 'Accountant- chartered'),
 (4, 'Accountant- chartered certified'),
 (5, 'Accountant- chartered management')]

In [22]:

%%sql

ALTER TABLE location RENAME TO old_location;

CREATE TABLE location
(
    location_id integer NOT NULL,
    zip integer,
    city [ NULL | NOT NULL ] COLLATE NOCASE,
    state [ NULL | NOT NULL ] COLLATE NOCASE,
    county [ NULL | NOT NULL ] COLLATE NOCASE,
    CONSTRAINT location_pkey PRIMARY KEY (location_id)
);

INSERT INTO location SELECT * FROM old_location;

DROP TABLE old_location;

 * sqlite:///connect_sql_jupyter.db
Done.
Done.
8583 rows affected.
Done.

[]

In [23]:
cnn.commit()

In [24]:
%%sql

SELECT *
FROM location
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(1, 601, 'Adjuntas', 'PR', 'Adjuntas'),
 (2, 610, 'Anasco', 'PR', 'AÃ±asco'),
 (3, 647, 'Ensenada', 'PR', 'GuÃ¡nica'),
 (4, 652, 'Garrochales', 'PR', 'Arecibo'),
 (5, 662, 'Isabela', 'PR', 'Isabela')]

In [25]:


%%sql

ALTER TABLE payment RENAME TO old_payment;

CREATE TABLE payment
(
    payment_id [ NULL | NOT NULL ]  NOT NULL,
    payment_type [ NULL | NOT NULL ]  COLLATE NOCASE,
    CONSTRAINT payment_pkey PRIMARY KEY (payment_id)
);

INSERT INTO payment SELECT * FROM old_payment;

DROP TABLE old_payment;

 * sqlite:///connect_sql_jupyter.db
Done.
Done.
4 rows affected.
Done.

[]

In [26]:
%%sql

SELECT *
FROM payment
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(1, 'Bank Transfer Automatic'),
 (2, 'Credit Card Automatic'),
 (3, 'Electronic Check'),
 (4, 'Mailed Check')]

# Review Data Alignment

In [27]:
%%sql

SELECT customer.job_id, job.job_title
FROM customer
INNER JOIN job
ON customer.job_id = job.job_id
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(229, 'Environmental health practitioner'),
 (468, 'Programmer- multimedia'),
 (96, 'Chief Financial Officer'),
 (552, 'Solicitor'),
 (371, 'Medical illustrator')]

In [28]:
%%sql

SELECT customer.contract_id, contract.duration
FROM customer
INNER JOIN contract
ON customer.contract_id = contract.contract_id
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(2, 'One year'),
 (1, 'Month-to-month'),
 (3, 'Two Year'),
 (3, 'Two Year'),
 (1, 'Month-to-month')]

# Additional Dataset Preparation

In [29]:
churn_other_data = pd.DataFrame

In [30]:
churn_other_data = pd.read_csv('internet_service_churn.csv')

In [31]:
print (churn_other_data.head())

   id  is_tv_subscriber  is_movie_package_subscriber  subscription_age  \
0  15                 1                            0             11.95
1  18                 0                            0              8.22
2  23                 1                            0              8.91
3  27                 0                            0              6.87
4  34                 0                            0              6.39

   bill_avg  reamining_contract  service_failure_count  download_avg  \
0        25                0.14                      0           8.4
1         0                 NaN                      0           0.0
2        16                0.00                      0          13.7
3        21                 NaN                      1           0.0
4         0                 NaN                      0           0.0

   upload_avg  download_over_limit  churn
0         2.3                    0      0
1         0.0                    0      1
2         0.9                    0      1
3         0.0                    0      1
4         0.0                    0      1

In [32]:
print(churn_other_data.isna().sum())

id                                 0
is_tv_subscriber                   0
is_movie_package_subscriber        0
subscription_age                   0
bill_avg                           0
reamining_contract             21572
service_failure_count              0
download_avg                     381
upload_avg                       381
download_over_limit                0
churn                              0
dtype: int64

In [33]:
churn_other_data[['reamining_contract','download_avg','upload_avg']]= churn_other_data[['reamining_contract','download_avg','upload_avg']].fillna(value=0)

In [34]:
print(churn_other_data.isna().sum())

id                             0
is_tv_subscriber               0
is_movie_package_subscriber    0
subscription_age               0
bill_avg                       0
reamining_contract             0
service_failure_count          0
download_avg                   0
upload_avg                     0
download_over_limit            0
churn                          0
dtype: int64

In [35]:
churn_other_data['churn']=churn_other_data['churn'].astype(str)
churn_other_data['churn']=churn_other_data['churn'].replace(['1'],'Yes')
churn_other_data['churn']=churn_other_data['churn'].replace(['0'],'No')
print (churn_other_data.head())

   id  is_tv_subscriber  is_movie_package_subscriber  subscription_age  \
0  15                 1                            0             11.95
1  18                 0                            0              8.22
2  23                 1                            0              8.91
3  27                 0                            0              6.87
4  34                 0                            0              6.39

   bill_avg  reamining_contract  service_failure_count  download_avg  \
0        25                0.14                      0           8.4
1         0                0.00                      0           0.0
2        16                0.00                      0          13.7
3        21                0.00                      1           0.0
4         0                0.00                      0           0.0

   upload_avg  download_over_limit churn
0         2.3                    0    No
1         0.0                    0   Yes
2         0.9                    0   Yes
3         0.0                    0   Yes
4         0.0                    0   Yes

In [36]:
churn_other_data['Number of Services'] = churn_other_data['is_tv_subscriber'] + churn_other_data['is_movie_package_subscriber']

In [37]:
print (churn_other_data.head())

   id  is_tv_subscriber  is_movie_package_subscriber  subscription_age  \
0  15                 1                            0             11.95
1  18                 0                            0              8.22
2  23                 1                            0              8.91
3  27                 0                            0              6.87
4  34                 0                            0              6.39

   bill_avg  reamining_contract  service_failure_count  download_avg  \
0        25                0.14                      0           8.4
1         0                0.00                      0           0.0
2        16                0.00                      0          13.7
3        21                0.00                      1           0.0
4         0                0.00                      0           0.0

   upload_avg  download_over_limit churn  Number of Services
0         2.3                    0    No                   1
1         0.0                    0   Yes                   0
2         0.9                    0   Yes                   1
3         0.0                    0   Yes                   0
4         0.0                    0   Yes                   0

In [38]:
churn_other_data.to_sql('internet_churn', cnn)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [39]:
%%sql

SELECT *
FROM internet_churn
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[(0, 15, 1, 0, 11.95, 25, 0.14, 0, 8.4, 2.3, 0, 'No', 1),
 (1, 18, 0, 0, 8.22, 0, 0.0, 0, 0.0, 0.0, 0, 'Yes', 0),
 (2, 23, 1, 0, 8.91, 16, 0.0, 0, 13.7, 0.9, 0, 'Yes', 1),
 (3, 27, 0, 0, 6.87, 21, 0.0, 1, 0.0, 0.0, 0, 'Yes', 0),
 (4, 34, 0, 0, 6.39, 0, 0.0, 0, 0.0, 0.0, 0, 'Yes', 0)]

In [40]:
%%sql

SELECT customer.churn, internet_churn.churn
FROM customer
INNER JOIN internet_churn
ON customer.churn = internet_churn.churn
LIMIT 5;

 * sqlite:///connect_sql_jupyter.db
Done.

[('No', 'No'), ('No', 'No'), ('No', 'No'), ('No', 'No'), ('No', 'No')]

In [41]:
%%sql

SELECT COUNT(customer.churn)
FROM customer
WHERE churn = 'yes' OR churn ='Yes';

 * sqlite:///connect_sql_jupyter.db
Done.

[(2650,)]

In [42]:
%%sql

SELECT COUNT(internet_churn.churn)
FROM internet_churn
WHERE churn = 'yes' OR churn ='Yes';

 * sqlite:///connect_sql_jupyter.db
Done.

[(40050,)]

# Database Export

In [43]:
contract_sql = pd.read_sql('SELECT * FROM contract', cnn, index_col = 'contract_id')
customer_sql = pd.read_sql('SELECT * FROM customer', cnn, index_col = 'customer_id')
location_sql = pd.read_sql('SELECT * FROM location', cnn, index_col = 'location_id')
job_sql = pd.read_sql('SELECT * FROM job', cnn, index_col = 'job_id')
payment_sql = pd.read_sql('SELECT * FROM payment', cnn, index_col = 'payment_id')
internet_churn_sql = pd.read_sql('SELECT * FROM internet_churn', cnn, index_col = 'id')

In [44]:
contract_sql.to_csv('data/contract.csv')
customer_sql.to_csv('data/customer.csv')
location_sql.to_csv('data/location.csv')
job_sql.to_csv('data/job.csv')
payment_sql.to_csv('data/payment.csv')
internet_churn_sql.to_csv('data/internet_churn.csv')